Revit 2024 API
DirectShapeType.AddReferenceCurve Method
Overload List
Name | Description
AddReferenceCurve(Curve)
 Adds a reference curve to the DirectShapeType.
AddReferenceCurve(Curve, DirectShapeReferenceOptions)
 Adds a reference curve to the DirectShapeType.
See Also
DirectShapeType Class
DirectShapeType Members
Autodesk.Revit.DB Namespace